org/blog.org
:CONFIG:
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+macro: updatetime {{{time(%B %e\, %Y)}}}
#+hugo_auto_set_lastmod: t
#+startup: hidestars
#+startup: overview
#+startup: logdone
# #+startup: inlineimages
# #+startup: latexpreview
:END:

#+title: Blog Source File
#+author: Prashant Tak

** Differential Geometry :noexport:
:PROPERTIES:
:EXPORT_FILE_NAME: dg-notes
:END:
*** Theory of Space Curves
**** Representation of space curves
+ Level Curve: f(x,y,z) = C
+ From level curves to parametrized curves:
  $y=x^{2} <-----> \gamma(t)=(\gamma_{1}(t),\gamma_{2}(t))$ Taking $\gamma_{1}(t)=t$, we get $\gamma_{2}(t)=t^{2}$ hence the parametrization is $\gamma(t)=(t,t^{2})$
+ *NOTE:* Check if domain of /x/ satisfies domain of /t/ or not. That is, the same parametrisation can be represented as $(t^{2}.t^{4})$ or $(t^{3},t^{6})$ but only the latter is a correct representation.
+ From parametrized curves to level curves:
  $\gamma(t)=(cos^{3}t,sin^{3}t)$ <------> F(x,y)=C; Using $sin^{2}t+cos^{2}t=1$ we get, $x^{2/3}+y^{2/3}=1$ as the level curve.
**** Unique Parametric representation
+ Class 'm' \rightarrow /f/ is m-differentiable
+ A curve is /smooth/ if $\frac{d^{n}f}{dt^{n}}$ exists for all n \geq 1 and t \in (\alpha,\beta)
+ A function /f/ is /analytic/ if it is single valued and of class \infty
+ A function is /regular/ if it is differentiable and derivative is non-zero (f dot \neq 0)
+ A /regular f/ of class /m/ can also be called a /*path*/ of class /m/.
+ *NOTE:* A point of a parametrized curve can have multiple tangents.
**** Arc-length
+ Arc-length of a curve \gamma is given by the function $s(t)=\int_{t_{0}}^{t}|| \dot{\gamma}(u)|| du$
+ Speed: \(|| \dot{\gamma}(t) ||_{t}\) and a curve is unit-speed curve if its magnitude is 1 for all /t/.
+ For \gamma being a unit speed curve, $\ddot{\gamma}$ is zero or perpendicular to $\dot{\gamma}$ i.e. $\ddot{\gamma}.\dot{\gamma}=0$
+ If \gamma is a regular curve, then its arclength S at any point of \gamma is a smooth function of t.
+ Reparametrization: $\overline{\gamma}:(\overline{\alpha},\overline{\beta}) \rightarrow R^{n}$ <=> $\gamma: (\alpha,\beta) \rightarrow R^{n}$  exists iff \exists a smooth function \phi: $(\overline{\alpha},\overline{\beta}) \rightarrow (\alpha,\beta)$ such that its inverse \phi^{-1} is also smooth.
+ A /unit speed reparametrization/ exists for a curve iff it is /regular/.
**** Tangent and Osculating Plane
+ Assuming \gamma is a class \geq 1 i.e. it has a power series expansion,
\[ \gamma(u)=\gamma(u_{0}+h)=\gamma(u_{0})+\frac{h}{1!}\dot{\gamma}(u_{0})+\frac{h^{2}}{2!}\ddot{\gamma}(u_{0})+ ... + \frac{h^{n}}{n!}\gamma^{n}(u_{0})+O(h^{n})
\]
  where $h = u-u_0$
+ Let \gamma be class m \geq 2 and (P,Q) be points limiting position of a plane that contains tangential line at P and passes through Q as Q \rightarrow P is defined as the /osculating plane/.
+ *Tangent line:* $\vec{R}(t)=\vec{r}(u_{0})+t \vec{r'}(u_{0})$ at $u_{0}$
+ *Osculating Plane:* $[\vec{R}-\vec{r(0)}, \vec{r'(0)}, \vec{r''(0)}]=0$ where $\vec{R}=(X,Y,Z)$ gives the equation of the OP (here $\vec{r''}(0)\neq0$). The product inside the box is /scalar triple product/. Also, the OP passes through the unit vector of the curve and is perpendicular to the unit binormal vector.
+ Note that for smallest k \geq 2 such that $\vec{r^{(k)}}=0$, the last term in the box is replaced by $\vec{r'}^{(k)}(0)$
**** Principal normal and binormal
+ *Normal Plane:* $\vec{t}(0).(\vec{R}-\vec{r}(0)) = 0$
  It is perpendicular to the tangent line and is spanned by /n,b/
+ *Principal Normal Vector:* For m \geq 1, $\vec{n}=\frac{\vec{r''}(0)}{||\vec{r''}(0)||}$
+ *Unit Binormal Vector:* $\vec{b}=\vec{t}\times\vec{n}$
+ OP: b.(R-r)
+ NP: t.(R-r)
+ RP: n.(R-r)
**** Curvature and Torsion
+ For a /unit speed curve/ or /arc length parametrized/ curve \gamma(t), the curvature \kappa(t) is defined as $||\ddot{\gamma}(t)||$ (1)
+ For a /regular/ curve \gamma(t) *in* $R^{3}$, $\kappa = \frac{||\ddot{\gamma}\times\dot{\gamma}||}{||\dot{\gamma}^{3}||}$
+ For a unit speed curve \gamma, /unit tangent vector/ $\hat{t}=\dot{\gamma}$ and for \kappa \neq 0, /unit normal vector/ is given by  $\hat{n}(s)=\frac{\dot{\hat{\gamma}}(s)}{\kappa(s)}$ since (1). And /unit binormal vector/ can be given by $\hat{b}=\hat{t}\times\hat{n}$
+ *Orthonormal Basis* of a curve is given by {$\hat{t},\hat{n},\hat{b}$}
+ Now b is given by t \times n , hence $\dot{b}=\dot{t}\times n+t\times\dot{n}$ , since $\dot{b}$ has to be perpendicular to t and b, $\implies \ddot{b}||n$, therefore $\boxed{\dot{b}=-\tau n}$ *iff* \kappa \neq 0.
+ Torsion measures the arc rate of turning of osculating plane.
+ For a regular curve \gamma in $R^{3}$ with \kappa \neq 0, the /torsion/ is given by
  \[
  \tau = \frac{(\dot{\gamma}\times\ddot{\gamma}).\dddot{\gamma}}{||\dot{\gamma}\times\ddot{\gamma}||^{2}}
  \]
+ Also, /radius of curvature/ \rho is inverse of curvature.
+ Finally, tying it all together is the /Serret-Frenet formula/ (arc length parameter):
  $\begin{bmatrix} \dot{t} \\
   \dot{n} \\
   \dot{b}  \end{bmatrix} = \begin{bmatrix} 0 & \kappa & 0 \\
    -\kappa & 0 & \tau \\
    0 & -\tau & 0 \end{bmatrix} \begin{bmatrix} t \\
    n \\
    b \end{bmatrix}$
**** Behaviour of a curve near one of its points
+ For a regular curve of class m \geq 2 with nonvanishing curvature, the curve is /planar/ iff \tau=0 everywhere.
+ For an analytic curve with arc length parameter, as s \rightarrow 0, a new parametrization for small s can be defined as:
  \[
    X = s - \frac{\kappa^{2}s^{3}}{6} - \frac{\kappa\kappa' s^{4}}{8} + o(s^{4})
  \]
  \[
    Y = \frac{\kappa s^{2}}{2} + \frac{\kappa' s^{3}}{6} + \frac{\kappa''-\kappa\tau-\kappa^{3}}{24} s^{4} + o(s^{4})
  \]
  \[
   Z = \frac{\kappa\tau}{6}s^{3} + \frac{2\kappa'\tau+\kappa\tau'}{24}s^{4} + o(s^{4})
  \]
+ Here the o notation represents that for f = o(g), as s \rightarrow 0, $lim \frac{f(s)}{g(s)}=0$
+ From previous theorem:
  1. $\kappa(0) = \lim_{s \to 0} \frac{2Y}{X^{2}}$
  2. $\tau(0) = \lim_{s \to 0} \frac{3Z}{XY}$
  3. For $P=\vec{r}(0), Q=\vec{r}(s)$, the length of chord
     \[
      PQ = s(1-\frac{\kappa^{2}s^{2}}{24}) + o(s^{3}) \~ s(1-\frac{\kappa^{2}s^{2}}{24})o(s^{3})
    \]
    If f(t)=g(t)+o(t), then as t \rightarrow 0, it can be written as f(t)~g(t)o(t)
+ The length of common perpendicular between tangents at two nearby points of $\vec{r}(s)$ at arcual distance /s/ is approximately $d=\frac{\kappa\tau s^{3}}{12}$. This is the shortest distance between tangents at nearby points of r(s).
**** Contact between curves and surface
+ For a surface S: F(x,y,z)=0 and a parametrized curve C: $\vec{r}(u)$ = (f(u),g(u),h(u)), let P be a point on C. P lies on S iff F(f(P),g(P),h(P))=0.
+ Let \phi(u) = F(f(u),g(u),h(u)) for any parameter value u. Then P lies on S iff \phi(u_{0})=0.
+ Assuming F and $\vec{r}$ are of class m for sufficiently large m, then \phi(u) has a taylor expansion where $\frac{O(h^{n+1})}{h^{n+1}}$ is bounded as h \rightarrow 0.
+ Definition: Surface S and a parametrized curve C has an /n-point contact/ (or contact of order n) at P if $\phi(u_{0}) = \phi'(u_{0}) = ... = \phi^{(n-1)}(u_{0}) = 0$ and $\phi^{(n)}(u_{0})\neq 0$
+ If S and C have a contact of order 1 at P then it is called a /simple intersection/ of S and C.
+ If P is in n-point contact of S and C, then S and C intersect at P in /n/ coincidental points.
+ Condition for /n-point contact/ at P is invariant under a change of parameter.
+ Osculating Plane at P of $\vec{r}$ has atleast a 3-point contact with $\vec{r}$ at P.
**** Osculating circle (circle of curvature)
+ For a regular curve $\vec{r}(s)$ of class m \geq 2, let $P=\vec{r}(0)$ and $P_{i}=\vec{r}(s_{i}), i=1,2,3$ be 3 non collinear points near P on the curve. Then there is a unique circle through all $P_{i}$. The limiting circle, if existent, for all $P_{i} \rightarrow P$ is called /osculating circle/ of r(s) at P.
+ Center of OC (c) is called /centre of curvature/ of r(s) at P while its radius \rho(0) is called radius of curvature. Also, the OC lies in the OP.
+ Theorem: $\rho(0)=\frac{1}{\kappa(0)}$, $\vec{c}(o)= \vec{r}(0)+\rho(0)\vec{n}(0)$
+ OC does not exist at points where curvature vanishes and OC of a circle is the same circle itself.
**** Osculating Sphere
+ Definition: For a regular path r(s) of class m \geq 2, assuming P = r(0) and \kappa(0)\tau(0) \neq 0, a sphere which has atleast a 4-point contact with r(s) at P is called /osculating sphere/ at P on r.
+ \rho(s)= $\frac{1}{\kappa(s)}$ is called radius of curvature and \sigma(s)= $\frac{1}{\tau(s)}$ is called radius of torsion of r(s)
+ Theorem: OS at P on r is given by $|\vec{c}-\vec{R}|^{2} = R^{2}$ where $R = \sqrt{\rho(0)^{2}+\sigma(0)^{2}\rho'(0)^{2}}$ and $\vec{c}=\vec{r}(0)+\rho(0)\vec{n}(0)+\sigma(0)\rho'(0)\vec{b}(0)$ where c and R are COSC and ROSC to r(s) at r(0)
+ Centre of OS lies in the normal plane of r(s) as $c-r(0)$ is a linear combination of n(0) and b(0)
+ If \kappa is constant then ROC=ROSC and COC=COSC. In particular, if r is a circle, then its its own OC and is a great circle of the OS.
**** Locus of centres of spherical curvature
+ Since COSC at r(s) is $c(s) =r(s)+\rho(s)n(s)+\sigma(s)\rho'(s)b(s)$, it moves along a path as /s/ varies. For this path, SFF, \kappa, \tau can be calculated and will be denoted with subscript c.
+ Assuming \tau(s)>0,
  1. $c'(s) = (\frac{\rho(s)}{\sigma(s)}+ \frac{d (\sigma(s)\rho'(s))}{ds})b(s)$
  2. For a regular c(s), unit tangent vector is $t_{c}(s) = eb(s)$
  3. $\frac{ds_{c}}{ds}=|\frac{\rho(s)}{\sigma(s)}+\frac{d(\sigma(s)\rho'(s))}{ds}|$
  Here e is 1 if ds_{c}/ds > 0, -1 ow. Also $e = t_{c}(s).b(s)$
+ Also on differentiating,
  1. $\kappa_{c}(s) = \frac{\tau(s)}{\frac{ds_{c}}{ds}}$ or \kappa(s)= $-\tau_{c}(s)e \frac{ds_{c}}{ds}$
  2. Which gives $\tau(s)\tau_{c}(s)=\kappa(s)\kappa_{c}(s)$
+ Theorem: ROC of center of curvatures (i.e. center of OCs) is given by
  \[
  \rho_{1} = [( \frac{\rho^{2}\sigma}{R^{3}}\frac{d}{ds}(\frac{\sigma\rho'}{\rho})-\frac{1}{R} )^{2} + \frac{\rho'^{2}\sigma^{4}}{\rho^{2}R^{4}}]^{-1/2}
  \]
**** Tangent surfaces, involutes and evolutes
+ Definition: Tangent surface to a curve r is union of all tangent lines to r at all its points.
+ Tangent line to r at r(s) is R(u,s) = r(s)+ur'(s)
+ For both varying r and u, one gets the tangent surface.
+ Image of the curve u=u(s) in us-plane gives a curve $r_{1}(s)=r(s)+u(s)r'(s)$
+ Definition: Involute of r is a curve on the tangent surface of r which meets all generating lines orthogonally at corresponding points.
+ If $r_{1}(s)$ denotes the pos vector on the involute C_1 of a curve C corresponding to its points r(s) then r_{1}(s)=r(s)+(c-s)t(s) for a constant c.
+ For an involute c(s) of a regular path r(s) of class m \geq 2.
  \[
    \kappa_{c}^2 = \frac{\tau^{2}+\kappa^{2}}{\kappa^{2}(c-s)^{2}}, \tau_c = \frac{\kappa\tau'-\kappa'\tau}{\kappa(c-s)(\tau^{2}+\kappa^{2})}
  \]

+ Definition: If $\overline{C}$ is an involute of C then C is called an evolute of $\overline{C}$.
+ For a regular curve r(s), evolute is given by $r_{1}(s)=r(s)+\rho(s)n(s)+\rho(s)cot(\psi(s)+c)b(s)$ where c is a constant and \psi(s) = $\int \tau(s)ds$
+ r(s) has infinitely many evolutes, as c is random constant. For a plane curve, \tau = 0.
+ Tangents to two different evolutes corresponding to two constans A and B drawn from the same point of the given curve are inclined to each other at a constant angle A-B.
  \[
    r_{1} = r+\rho\textbf{n}-\rho tan(\psi+a)\textbf{b}
  \]
  Further $\psi = \int \tau ds$ so that \psi'=\tau...
*** First Fundamental Form and Local Intrinsic Properties of a Surface
**** Introduction
+ The surfaces are defined similar to curves by an equation of the type F(/x,y,z/) = 0 or parametrically by expressing /x,y,z/ in terms of two parameters /u,v/ varying over a domain.
+ After defining the surface locally, its points are classified as ordinary or singular.
+ Then using tangent plane at a point and the surface normal at it, a coordinate system *\((r_1, r_2, N)\)* at every point of the surface is introduced.
+ After that, a certain quadratic differential form known as /first fundamental form/ on a surface and direction coefficients are introduced.
**** Definition of a Surface
*Definition 1:* Locus of a point P(/x,y,z/) in $E_{3}$ satisfying some restrictions on /x,y,z/ which is expressed by a relation of the type F(/x,y,z/) = 0.

This equation is called the /implicit/ or the /constraint/ equation of the surface which allows for a global study of the surface.

*Definition 2:* For parameters /u, v/ taking real values and varying over a domain D, a surface is defined /parametrically/ as
  \[
      x = f(u,v), y = g(u,v), z = h(u,v)
  \]
  where /f, g/ and /h/ are single valued continuous functions possessing continuous derivatives of /r/-th order. Such surfaces are called surfaces of class /r/.

Parametric representation is useful for local study of surfaces i.e. in the neighbourhood of a point which is a small region *but* it is not unique for a surface. Also, the parameters /u/ and /v/ are called /curvilinear coordinates/.

*Definition 3:* For two parametric representations /u, v/ and /u', v'/ of the same surface, any transformation of the form $u'=\phi(u,v)$ and $v'=\psi(u,v)$ relating the two representations is called a /parametric transformation/.

*Definition 4:* A parametric transformation is /proper/ if:
  1. \phi and \psi are single valued functions.
  2. The Jacobian $\frac{\delta (\phi,\psi)}{\delta (u,v)}\neq0$ in some domain D.
These conditions are necessary and sufficient for existence of inverse in the neighbourhood of any point in D' which is the domain of /u', v'/ corresponding to the domain D of the /u, v/ plane.
**** Nature of Points on a Surface
*Notation:* For *r* being the position vector of a point on the surface, *r* = (x,y,z), we can take r = r(u,v) as the parametric form of the surface and use $r_1 = \frac{\delta r}{\delta u} = (x_{1},y_{1},z_{1})$ and $r_2 = \frac{\delta r}{\delta v} = (x_{2},y_{2},z_{2})$, similarly we can denote second order derivatives using $r_{11}, r_{21}$ etc.

*Definition 1:* If $r_{1}\times r_{2}\neq0$ at a point on a surface, then the point is called an /ordinary/ point. A point which is not an ordinary point is called a /singularity/.

Remarks:
+ Considering M = $\begin{bmatrix} x_{1} & y_{1} & z_{1}\\
  x_{2} & y_{2} & z_{2}\end{bmatrix}$
  For $r_{1} \times r_{2} \neq 0$ at an ordinary point, i.e. rank of M is two at that point.
+ If the rank of M is either zero or one, the point on the surface is a singular point.
+ If $r_{1} \times r_{2}\neq0$ or equivalently rank of M is two, then /x,y,z/ uniquely determine the parameters /u,v/ in the neighbourhood of an ordinary point.
+ When only one determinant minor of M is zero, one cannot conclude that the point is a singular point.
+ A /proper/ parametric transformation transforms an ordinary point into an ordinary point.
+ Due to geometrical nature of the surface, some singularities continue to be singularities, regardless of the parametric representations, these are called /essential singularities/.
+ There are other singularities depending on the choice of parametric representation which are called /artificial singularities/.
*Example:* Consider the circular cone represented by /x = u sin\alpha cosv, y = u sin\alpha sinv, z = u cos\alpha/ where \alpha is the semivertical angle of cone with O as origin and OP = /u/, where P is any point on the cone.
Computing M, then at /u/ = 0, the determinant of every second order minor is zero, hence it is an essential singularity.

*Example:* Taking any point 0 as origin in the plane, /x = u cosv, y = u sinv, z = 0/, we get $r_{1} \times r_{2} = u\textbf{k}$. Hence it is zero only when /u/ = 0 i.e. it is an artificial singularity /since/ it arises due to the choice of the parametric coordinates and not due to the nature of the surface.
**** Representation of a Surface
For our study of surfaces, we consider only ordinary points. And we consider the entire surface as a collection of parts, each part being given a particular parametrisation and the adjacent parts being related by a /proper/ parametric transformation.

*Definition 1:* A representation R of a surface S of class /r/ in $E_{3}$ is a collection of points in $E_{3}$ covered by a system of overlapping parts ${S_{j}}$ where each part {{$S_{j}$} is given by a parametric equation of class /r/. Each point lying in the common portion of two parts $S_{i}, S_{j}$ is such that the change of parameters from one part to is adjacent is given by a /proper/ parametric transformation of class /r/.

*/Note:/* Since one cannot parameterise the whole surface without introducing artificial singularities, one has to resort to a surface composed of many overlapping parts.

It is possible to have many representations of the same surface by considering different systems of overlapping parts ($S_{j}$), each part is given by a parametric equation of class /r/.

*Definition 2:* For R and R' being two representations of class /r/ of the surface S, they are /equivalent/ if the composite family of parts {$S_{j},S'_{j}$} satisfies the condition that for each point P lying in the place of overlap, the change of parameter from $S_{j}$  to $S'_{j}$ at P is given by a proper parametric transformation of class r.

*Theorem:* The notion of /r/-equivalence of representations of a surface is an equivalence relation.

This equivalence relation introduces a partition into the family of surfaces of class /r/ splitting them into mutually disjoint equivalence classes, each class containing the surface equivalent to one another in the above equivalence relation.

*Definition 3:* A surface S of class /r/ in $E_{3}$ is an /r/-equivalence class of representations.

Thus a surface consists of different overlapping portions related to one another by proper parametric transformations and all other surfaces related to the given one by the equivalence relation of class /r/.
**** Curves on Surfaces
For a surface *r* = r(/u,v/), let /u = u(t)/ and /v = v(t)/ be a curve of class /s/ lying in the domain D of the /uv/-plane. Considering *r* = r[u(t), v(t)] which gives the position vector of a point in terms of a single parameter /t/ such that it is a curve lying on a surface with class equal to the smaller of /r/ and /s/. The equation /u = u(t)/ and /v = v(t)/ are called /curvilinear equations/ of the curve on the surface.

*Definition 1:* For *r*, a given surface of class /r/, let /v = c/, then position vector *r* = r(u,c) is a function of a single parameter /t/ and hence *r* = r(u,c) represents a curve lying on the surface *r* = r(u,v). This curve is called the /parametric curve/ v = constant.

By varying the values of /c/, a system of parametric curves /v/ = constant is generated and similarly another system is generated by keeping /u/ constant and varying /v/.

Properties that are a consequence of assuming only ordinary points on the surface:
1. Through every point of the surface, there passes one and only one parametric curve of each system.
2. No two curves of the same system intersect.
3. The curves of the system $u=u_{o}$ and $v=v_{o}$ intersect once but not more than once if $(u_{o},v_{o}) \in D$.
4. The parametric curves of the system u = $c_{1}$ and v = $c_{2}$ cannot touch each other.

*Definition 2:* Let u = $c_{1}$ and v = $c_{2}$, when the constants vary, the whole surface is covered with a net of parametric curves, two of which pass through each point.

*Definition 3:* Two parametric curves through a point P are /othogonal/ if $\textbf{r}_{1}.\textbf{r}_{2}= 0$ at P.
**** Tangent Plane and Surface Normal
Let *r* = r[u(t), v(t)] be a general curve lying on the surface passing through [u(t), v(t)], then the tangent to the curve at any point P on the surface is
\[
\frac{dr}{dt} = r_{1}\frac{du}{dt}+r_{2}\frac{dv}{dt}
\]
*Definition 1:* Tangent to any curve drawn on a surface is called a tangent line to the surface. The tangents to different curves through P on a surface lie in a plane containing two independent vectors $r_{1}$ and $r_{2}$ at P called the /tangent plane/ at P.

*Theorem 1:* The equation of a tangent plane at P on a surface with position vector *r* = r(u,v) is either \(R = r+ar_{1}+br_{2}\) or \((R-r).(r_{1}\times r_{2}) = 0\) where a and b are parameters.

*Definition 2:* The normal to the surface P is a line through P and perpendicular to the tangent plane at P.

*Theorem 2:* The equation of the normal *N* at a point P on the surface r = r(u,v) is \(R=r+a(r_{1}\times r_{2})\).

*Theorem 3:* A proper parametric transformation either leaves every normal unchanged or reverses the direction of the normal.
**** General Surface of Revolution
*Definiton 1:* A surface generated by the rotation of a plane curve about an axis in its plane is called a /surface of revolution/.

*Theorem 1:* The position vector of any point on the surface of revolution generated by the curve [g(u),o,f(u)] in the XOZ plane is
  $\textbf{r} = [g(u)cosv, g(u)sinv, f(u)]$
where /v/ is the angle of roatation about the /z/-axis.
